// Напиши скрипт управления личным кабинетом интернет банка. Есть объект account в котором необходимо реализовать методы для работы с балансом и историей транзакций.


/*
 * Типов транзацкий всего два.
 * Можно положить либо снять деньги со счета.
 */
// const Transaction = {
//     DEPOSIT: 'deposit',
//     WITHDRAW: 'withdraw',
//   };
  
  /*
   * Каждая транзакция это объект со свойствами: id, type и amount
   */
  
//   const account = {
    // Текущий баланс счета
    // balance: 0,
  
    // История транзакций
    // transactions: [],
  
    /*
     * Метод отвечающий за добавление суммы к балансу
     * Создает объект транзакции и вызывает addTransaction
     */
    // deposit(amount) {},
  
    /*
     * Метод отвечающий за снятие суммы с баланса.
     * Создает объект транзакции и вызывает addTransaction
     *
     * Если amount больше чем текущий баланс, выводи сообщение
     * о том, что снятие такой суммы не возможно, недостаточно средств.
     */
    // withdraw(amount) {},
  
    /*
     * Метод добавляющий транзацию в свойство transactions
     * Принимает объект трназкции
     */
    // addTransaction(transaction) {},
  
    /*
     * Метод возвращает текущий баланс
     */
    // getBalance() {},
  
    /*
     * Метод ищет и возвращает объект транзации по id
     */
    // getTransactionDetails(id) {},
  
    /*
     * Метод возвращает количество средств
     * определенного типа транзакции из всей истории транзакций
     */
//     getTransactionTotal(type) {},
//   };